In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import plotly
import plotly.express as px

city_data =  ("data/city_data.csv")
ride_data =  ("data/ride_data.csv")

city_df = pd.read_csv(city_data)
ride_data_df = pd.read_csv(ride_data)

data = city_df.merge(ride_data_df, on = 'city')
# data=merge_df.drop_duplicates('city')

data

,city,driver_count,type,date,fare,ride_id
0,Richardfort,38,Urban,2018-02-24 08:40:38,13.93,5628545007794
1,Richardfort,38,Urban,2018-02-13 12:46:07,14.00,910050116494
2,Richardfort,38,Urban,2018-02-16 13:52:19,17.92,820639054416
3,Richardfort,38,Urban,2018-02-01 20:18:28,10.26,9554935945413
4,Richardfort,38,Urban,2018-04-17 02:26:37,23.00,720020655850
...,...,...,...,...,...,...
2370,Jessicaport,1,Rural,2018-01-31 17:57:25,58.29,623154556195
2371,South Saramouth,7,Rural,2018-02-20 16:32:36,44.29,3622365199969
2372,South Saramouth,7,Rural,2018-01-28 15:55:33,31.25,7118046558393
2373,South Saramouth,7,Rural,2018-03-27 21:07:16,11.87,170351888128
2374,South Saramouth,7,Rural,2018-04-12 18:11:50,57.23,5081198789583

## analysys on rides useing groupby

In [2]:
rides_total = data.groupby(['type', 'city'], as_index=False)['ride_id'].count()
# rides_total = rides_total.sort_values(['type', 'ride_id'], ascending=[True, False]).groupby('type').head()
Rides_total= rides_total.rename({'ride_id':'total rides'},axis=1)

avg_fare = data.groupby(['type', 'city'], as_index=False)['fare'].mean()
# avg_fare = fare_avg.sort_values(['type', 'fare'], ascending=[True, False]).groupby('type').head()
Avg_fare = avg_fare.rename({'fare':'average fare'},axis=1)

total_fare = data.groupby(['type', 'city'], as_index=False)['fare'].sum()
# total_fare = fare_total.sort_values(['type', 'fare'], ascending=[True, False]).groupby('type').head()
Total_fare =total_fare.rename({'fare':'Total fare'},axis=1)

driver_total = data.groupby(['type', 'city'], as_index=False)['driver_count'].sum()
# driver_total= total_driver.sort_values(['type', 'driver_count'], ascending=[True, False]).groupby('type').head()
Driver_total= driver_total.rename({'driver_count':'Total Drivers'},axis=1)

In [17]:
lenth1 = len(combined_df)

5976

In [19]:
combined_df.sort_values("city", inplace=True)

       type  average fare  total rides          city
5052  Urban     28.571290           18   Amandaburgh
4194  Urban     21.919474           18   Amandaburgh
2544  Urban     26.340000           18   Amandaburgh
2082  Urban     25.221200           18   Amandaburgh
2874  Urban     21.243810           18   Amandaburgh
...     ...           ...          ...           ...
4259  Urban     21.919474           20  Williamsview
4325  Urban     22.373214           20  Williamsview
4391  Urban     23.729167           20  Williamsview
3665  Urban     22.623600           20  Williamsview
5975  Urban     26.599000           20  Williamsview

[5976 rows x 4 columns]

In [21]:
combined_df.drop_duplicates(keep=False,inplace=True)
combined_df

       type  average fare  total rides          city
5052  Urban     28.571290           18   Amandaburgh
4194  Urban     21.919474           18   Amandaburgh
2544  Urban     26.340000           18   Amandaburgh
2082  Urban     25.221200           18   Amandaburgh
2874  Urban     21.243810           18   Amandaburgh
...     ...           ...          ...           ...
4259  Urban     21.919474           20  Williamsview
4325  Urban     22.373214           20  Williamsview
4391  Urban     23.729167           20  Williamsview
3665  Urban     22.623600           20  Williamsview
5975  Urban     26.599000           20  Williamsview

[5976 rows x 4 columns]

<h1> Combine Avg fare and total rides </h1>

In [12]:
combined_df = pd.merge(Avg_fare,Rides_total,  on = 'type',
                      suffixes=('_m','_n'), indicator=True)
combined_df['city']= combined_df['city_m'].where(combined_df['city_n'].isnull(),
                                                combined_df['city_n'])
# # combined_df[['type','city','city_m','city_n']]
combined_df.drop(['city_m','city_n','_merge'], axis=1, inplace=True)
combined_df

       type  average fare  total rides                 city
0     Rural        40.064           10         Bradshawfurt
1     Rural        40.064            3            Garzaport
2     Rural        40.064            6       Harringtonfort
3     Rural        40.064            6          Jessicaport
4     Rural        40.064            6           Lake Jamie
...     ...           ...          ...                  ...
5971  Urban        26.599           16  West Patrickchester
5972  Urban        26.599           31          West Robert
5973  Urban        26.599           25     West Samuelburgh
5974  Urban        26.599           23         Williamsstad
5975  Urban        26.599           20         Williamsview

[5976 rows x 4 columns]

In [ ]:
# combined =combined_df.drop_duplicates('city', keep = 'first')
# combine

In [10]:
# combined_df = combined_df[['type','average fare','total rides', 'city']]
# combined_df.sort_values(by='rider count', ascending=0)
Total_fare

      type                 city  Total fare
0    Rural         Bradshawfurt      400.64
1    Rural            Garzaport       72.37
2    Rural       Harringtonfort      200.82
3    Rural          Jessicaport      216.08
4    Rural           Lake Jamie      206.15
..     ...                  ...         ...
115  Urban  West Patrickchester      451.73
116  Urban          West Robert      778.84
117  Urban     West Samuelburgh      544.19
118  Urban         Williamsstad      560.33
119  Urban         Williamsview      531.98

[120 rows x 3 columns]

<h1> Combine total fare and driver total </h1>

In [5]:
df = pd.merge(Total_fare,Driver_total, how ='outer', on = 'type',
                      suffixes=('_m','_n'), indicator=True)
df['city']= df['city_m'].where(df['city_n'].isnull(),
                                                df['city_n'])
df[['type','city','city_m','city_n']]
df.drop(['city_m','city_n','_merge'], axis=1, inplace=True)

In [9]:
df.head()

    type  Total fare  Total Drivers            city
0  Rural      400.64             70    Bradshawfurt
1  Rural      400.64             21       Garzaport
2  Rural      400.64             24  Harringtonfort
3  Rural      400.64              6     Jessicaport
4  Rural      400.64             24      Lake Jamie

<h1> Combine DF and Combine_df in to one </h1>

In [ ]:
merge_df = pd.merge(df,combined, how ='outer', on = 'type',
                      suffixes=('_m','_n'), indicator=True)
merge_df['city']= merge_df['city_m'].where(merge_df['city_n'].isnull(),
                                                merge_df['city_n'])
merge_df[['type','city','city_m','city_n']]
merge_df.drop(['city_m','city_n','_merge'], axis=1, inplace=True)

merge_df= merge_df.drop_duplicates('city', keep = 'first')

In [ ]:
merge_df.shape

<h3>Change order of coloums in data frame<h3>

In [ ]:
merge_df = merge_df[['city','type','rider count','total drivers','average fare','total fare']]
merge_df

<h3>Separate by type <h3>

In [ ]:
Rural = merge_df.loc[merge_df["type"]=="Rural",:]
rural_report = Rural.loc[:,('city','rider count','total drivers','average fare','total fare')]
rural_report.sort_values(by='rider count', ascending=0)

In [ ]:
Urban_df = merge_df.loc[merge_df["type"]=="Urban",:]
urban_report = Urban_df.loc[:,('city','rider count','total drivers','average fare','total fare')]

In [ ]:
urban_report

# Create Bar Graphs

In [ ]:
type_total_fare= data.groupby(['type'], as_index=False)['fare'].sum()
avg_type_fare =data.groupby(['type'], as_index=False)['fare'].mean()
type_total_rides =data.groupby(['type'], as_index=False)['ride_id'].count()
drivers_total = =data.groupby(['type'], as_index=False)['driver_count'].sum()